Repository: RundizBones/ModuleAdmin
Catalog: languages/translations/rdbadmin-*.po
Languages: th

source: Access denied!
th: ปฏิเสธการเข้าถึง!

source: Forgot username or password?
th: ลืมชื่อผู้ใช้หรือรหัสผ่าน?

source: Unable to validate token or your token may expired.
th: ไม่สามารถตรวจสอบโทเคนได้ หรือโทเคนของคุณอาจหมดอายุแล้ว.

source: Reset your password
th: ตั้งค่ารหัสผ่านใหม่

source: Please enter your email.
th: กรุณากรอกอีเมลของคุณ.

source: You have entered incorrect data.
th: คุณกรอกข้อมูลไม่ถูกต้อง.

source: The email has just been sent recently, please wait and try again later.
th: อีเมลเพิ่งถูกส่งไม่นานนี้, กรุณารอและลองใหม่ในภายหลัง.

source: The email was not found.
th: ไม่พบอีเมลดังกล่าว.

source: Your account has been disabled. (%1$s)
th: บัญชีผู้ใช้ของคุณถูกระงับการใช้งาน. (%1$s)

source: You had requested to reset your password.
th: คุณได้ร้องขอตั้งค่ารหัสผ่านใหม่.

source: An email has been sent, please check your email and follow instruction.
th: อีเมลถูกส่งแล้ว, โปรดตรวจอีเมลของคุณและทำตามคำแนะนำ.

source: An email could not be sent.
th: ไม่สามารถส่งอีเมลได้.

source: Unable to validate token, please try again. If this problem still occur please reload the page and try again.
th: ไม่สามารถตรวจสอบโทเคน, โปรดลองอีกครั้ง. ถ้าปัญหานี้ยังอยู่ โปรดโหลดหน้านี้แล้วลองอีกครั้ง.

source: Please enter your new password.
th: กรุณากรอกรหัสผ่านใหม่ของคุณ.

source: Your new password and confirm does not matched.
th: รหัสผ่านใหม่ของคุณและรหัสผ่านที่ยืนยันนั้นไม่ตรงกัน.

source: Unable to update your new password, please try again.
th: ไม่สามารถอัปเดทรหัสผ่านใหม่ของคุณได้, โปรดลองอีกครั้ง.

source: Success, you can now login using your new password.
th: สำเร็จ, คุณสามารถเข้าสู่ระบบด้วยรหัสผ่านใหม่นี้ได้แล้ว.

source: Administrator dashboard
th: หน้าแรกผู้ดูแล

source: Please enter username and password.
th: กรุณากรอกชื่อผู้ใช้หรือรหัสผ่าน.

source: Login
th: เข้าสู่ระบบ

source: Login recovery
th: กู้คืนการเข้าสู่ระบบ

source: Logging you out.
th: กำลังนำคุณออกจากระบบ.

source: You are now logged out.
th: คุณได้ออกจากระบบแล้ว.

source: Logout
th: ออกจากระบบ

source: Updated successfully.
th: อัพเดทเรียบร้อย.

source: Please select at least one module.
th: โปรดเลือกอย่างน้อยหนึ่งโมดูล.

source: You couldn't modify current module via web based (%1$s).
th: คุณไม่สามารถปรับแต่งโมดูลปัจจุบันผ่านหน้าเว็บได้ (%1$s).

source: Please select an action.
th: โปรดเลือกการทำงาน.

source: Modules Assets
th: Assets ของโมดูล

source: Your module folder is already in public, it is no need to publish anything.
th: โฟลเดอร์โมดูลของคุณอยู่ในระดับเดียวกับโฟลเดอร์สาธารณะอยู่แล้ว, ไม่จำเป็นต้องเผยแพร่อะไรอีก.

source: Are you sure?
th: คุณแน่ใจหรือไม่?

source: This will be overwrite any existing assets files and folders in the public folder.
th: นี่จะเป็นการเขียนทับไฟล์และโฟลเดอร์ใดๆที่อยู่ในโฟลเดอร์สาธารณะ.

source: Disabled
th: ปิดใช้งาน

source: Enabled
th: เปิดใช้งาน

source: Invalid form action
th: การทำงานของฟอร์มไม่ถูกต้อง

source: Success. The results is in a log file located at %1$s.
th: สำเร็จ. ผลลัพธ์ถูกบันทึกอยู่ในไฟล์ล็อกที่ %1$s.

source: Modules
th: โมดูล

source: Please select at least one plugin.
th: โปรดเลือกปลั๊กอินอย่างน้อยหนึ่งอย่าง.

source: Enable plugin
th: เปิดใช้งานปลั๊กอิน

source: Disable plugin
th: ปิดใช้งานปลั๊กอิน

source: Modules Plugins
th: โมดูลปลั๊กอิน

source: Unable to clear permissions for selected module, please reload the page and try again.
th: ไม่สามารถล้างค่าการอนุญาตสำหรับโมดูลที่เลือก, กรุณาโหลดหน้านี้แล้วลองใหม่อีกครั้ง.

source: All permissions for %1$s module were cleared successfully.
th: การอนุญาตทั้งหมดสำหรับโมดูล %1$s ถูกล้างค่าสำเร็จแล้ว.

source: Could not update. Please reload the page and try again, if problem still exists please contact administrator.
th: ไม่สามารถปรับปรุงได้. โปรดโหลดหน้านี้แล้วลองใหม่อีกครั้ง, ถ้าปัญหายังอยู่โปรดติดต่อผู้ดูแล.

source: Deleted successfully.
th: ลบสำเร็จ.

source: Unable to delete.
th: ไม่สามารถลบได้.

source: Unable to set permission.
th: ไม่สามารถกำหนดการอนุญาต.

source: Page
th: หน้า

source: Action
th: การทำงาน

source: Manage permissions
th: จัดการการอนุญาต

source: Admin home
th: หน้าแรกผู้ดูแล

source: Are you sure to clear all permissions for selected module (%s)?
th: คุณแน่ใจหรือไม่ที่จะล้างค่าการอนุญาตทั้งหมดสำหรับโมดูลที่เลือก (%s)?

source: This cannot be undone, any users that are in the highest role priority will always have full control.
th: นี่จะไม่สามารถเลิกทำได้, ผู้ใช้ใดๆที่มีหน้าที่สำคัญที่สุดจะยังคงเข้าถึงการควบคุมได้ทุกอย่างเสมอ.

source: Loading &hellip;
th: กำลังโหลด &hellip;

source: No data
th: ไม่มีข้อมูล

source: Permissions for this role cannot be changed.
th: การอนุญาตสำหรับหน้าที่นี้ไม่สามารถเปลี่ยนแปลงได้.

source: Confirm register
th: ยืนยันสมัครสมาชิก

source: Please set your password.
th: กรุณากำหนดรหัสผ่านของคุณ.

source: Your password and confirm does not matched.
th: รหัสผ่านของคุณและรหัสผ่านที่ยืนยันนั้นไม่ตรงกัน.

source: The password hashing was error, please contact administrator.
th: มีข้อผิดพลาดในการเก็บรหัสผ่าน, โปรดติดต่อผู้ดูแล.

source: User was not found.
th: ไม่พบผู้ใช้.

source: The registration confirm key was not match, please check your link that is correctly.
th: รหัสยืนยันการสมัครสมาชิกไม่ถูกต้อง, โปรดตรวจสอบลิ้งค์ว่าถูกต้อง.

source: Success, you can use your username and password to login now. Go to %1$slogin page%2$s.
th: สำเร็จ, คุณสามารถใช้ชื่อผู้ใช้และรหัสผ่านเข้าสู่ระบบได้เลย. ไปยังหน้า%1$sเข้าสู่ระบบ%2$s.

source: The registration was already confirmed.
th: การสมัครสมาชิกได้รับการยืนยันแล้ว.

source: Access denied! The registration is currently disabled.
th: ปฏิเสธการเข้าถึง! ยังไม่เปิดใช้งานการลงทะเบียนสมัครสมาชิก.

source: Your registration was success!
th: การสมัครสมาชิกของคุณสำเร็จแล้ว!

source: You can use your username and password to login now.
th: คุณสามารถใช้ชื่อผู้ใช้และรหัสผ่านเข้าสู่ระบบได้เลย.

source: Please fill all required form.
th: โปรดกรอกฟอร์มที่จำเป็น.

source: Please enter a valid username.
th: กรุณากรอกชื่อผู้ใช้ที่ถูกต้อง.

source: Please enter your correct email.
th: โปรดกรอกอีเมลที่ถูกต้อง.

source: Username and password could not be same.
th: ชื่อผู้ใช้และรหัสผ่านไม่สามารถเหมือนกันได้.

source: Disallowed username.
th: ไม่อนุญาตชื่อผู้ใช้.

source: Disallowed email.
th: ไม่อนุญาตอีเมล.

source: Disallowed display name.
th: ไม่อนุญาตชื่อแสดง.

source: This username is already in use.
th: ชื่อผู้ใช้นี้มีคนใช้อยู่แล้ว.

source: This email is already in use.
th: อีเมลนี้มีคนใช้อยู่แล้ว.

source: Confirmation required.
th: ต้องการการยืนยัน.

source: Success! Your registration needs confirmation, please open your email and follow instruction.
th: สำเร็จ! การสมัครสมาชิกของคุณต้องการการยืนยัน, โปรดเปิดอีเมลของคุณและทำตามคำแนะนำ.

source: Your registration was successfull.
th: การสมัครสมาชิกสำเร็จแล้ว.

source: Please contact administrator to confirm your account.
th: โปรดติดต่อผู้ดูแลเพื่อยืนยันบัญชีผู้ใช้ของคุณ.

source: There is a user registration.
th: มีผู้ใช้สมัครสมาชิก.

source: Action required.
th: ต้องมีการดำเนินการ.

source: The user needs administrator to confirm their registration.
th: ผู้ใช้ต้องการผู้ดูแลยืนยันการสมัครสมาชิก.

source: Please go to %1$sadministrator page%2$s.
th: โปรดไปยัง%1$sหน้าผู้ดูแล%2$s.

source: Go to %1$sadministrator page%2$s.
th: ไปยัง%1$sหน้าผู้ดูแล%2$s.

source: Success! You have to wait for administrator to confirm your registration.
th: สำเร็จ! คุณต้องรอผู้ดูแลยืนยันการสมัครสมาชิกของคุณ.

source: Create new account
th: สร้างบัญชีผู้ใช้ใหม่

source: Please select user's default role.
th: โปรดเลือกหน้าที่ค่าเริ่มต้น.

source: Please select replace user's role.
th: โปรดเลือกหน้าที่ที่จะแทนที่ของผู้ใช้ที่มีอยู่และจะถูกลบไป.

source: Confirmation required
th: ต้องการการยืนยัน

source: Manage roles
th: จัดการหน้าที่

source: Please select at least one role.
th: โปรดเลือกหน้าที่อย่างน้อยหนึ่งรายการ.

source: Delete role
th: ลบหน้าที่

source: Unable to delete restricted roles.
th: ไม่สามารถลบหน้าที่ที่ถูกจำกัดไว้.

source: Please enter role name.
th: กรุณากรอกชื่อหน้าที่.

source: New role created.
th: สร้างหน้าที่ใหม่แล้ว.

source: Edit role
th: แก้ไขหน้าที่

source: Unable to add new role, please contact administrator.
th: ไม่สามารถเพิ่มหน้าที่ใหม่ได้, โปรดติดต่อผู้ดูแล.

source: Add new role
th: เพิ่มหน้าที่ใหม่

source: Role updated
th: ปรับปรุงหน้าที่เรียบร้อยแล้ว

source: Unable to update role, please contact administrator.
th: ไม่สามารถบันทึกหน้าที่ได้, โปรดติดต่อผู้ดูแล.

source: There are problems with your items, please reload the page and try again.
th: มีปัญหาบางอย่างเกี่ยวกับรายการของคุณ, กรุณาโหลดหน้านี้แล้วลองใหม่อีกครั้ง.

source: Some of items were updated successfully.
th: บางรายการถูกอัพเดทเรียบร้อย.

source: Unable to update restricted roles.
th: ไม่สามารถอัพเดทหน้าที่ที่ถูกจำกัดไว้.

source: Not found selected role.
th: ไม่พบหน้าที่ที่เลือก.

source: The image dimension in `imageSizes` constant is invalid.
th: ขนาดภาพในค่าคงที่ `imageSizes` ไม่ถูกต้อง.

source: Please enter all required fields.
th: โปรดกรอกฟอร์มที่จำเป็น.

source: Please enter API key.
th: กรุณากรอกกุญแจ API.

source: Some setting value has not been update, please reload the page and see what was changed.
th: การตั้งค่าบางอย่างไม่ถูกอัพเดท, โปรดโหลดหน้านี้ใหม่แล้วดูว่ามีสิ่งใดเปลี่ยนแปลงไปบ้าง.

source: Main settings
th: การตั้งค่าหลัก

source: Are you sure to delete? This action cannot be undone.
th: คุณแน่ใจหรือไม่ว่าจะลบ? การกระทำนี้จะไม่สามารถยกเลิกได้.

source: Please choose one file.
th: โปรดเลือกหนึ่งไฟล์.

source: Uploading.
th: กำลังอัพโหลด.

source: Unable to test other mail protocol.
th: ไม่สามารถทดสอบโปรโตคอลอีเมลอื่นๆได้.

source: An error has been occurred.
th: มีข้อผิดพลาดเกิดขึ้น.

source: Connection was successfull.
th: การเชื่อมต่อสำเร็จ.

source: All cache was cleared.
th: แคชถูกล้างหมดแล้ว.

source: Unable to clear cache.
th: ไม่สามารถล้างแคชได้.

source: Manage cache
th: จัดการแคช

source: Please choose a command
th: โปรดเลือกคำสั่ง

source: Please enter target email.
th: กรุณากรอกอีเมลปลายทาง.

source: Email tester
th: ทดสอบอีเมล

source: The email was sent successfully.
th: ส่งอีเมลสำเร็จแล้ว.

source: The email could not be sent.
th: ไม่สามารถส่งอีเมลได้.

source: Framework
th: เฟรมเวิร์ค

source: Version %1$s
th: รุ่น %1$s

source: Administration module for RundizBones
th: โมดูลผู้ดูแลสำหรับ RundizBones

# translation for datatables.
source: No data
th: ไม่มีข้อมูล

# translation for datatables.
source: Search:
th: ค้นหา:

# translation for datatables.
source: First
th: หน้าแรก

# translation for datatables.
source: Last
th: หน้าสุดท้าย

# translation for datatables.
source: Next
th: ถัดไป

# translation for datatables.
source: Previous
th: ก่อนหน้า

# translation for datatables.
source: Page _INPUT_ of _TOTAL_
th: หน้า _INPUT_ จาก _TOTAL_

# translation for datatables.
source: Processing...
th: กำลังประมวลผล...

source: Guest
th: ผู้เยี่ยมชม

source: Sorry, this page is for request via XHR, REST API.
th: ขออภัย, หน้านี้สำหรับ XHR, REST API.

source: Please reload the page and try again.
th: กรุณาโหลดหน้านี้แล้วลองใหม่อีกครั้ง.

source: Delete my account
th: ลบบัญชีผู้ใช้ของฉัน

source: Users
th: ผู้ใช้

source: Edit user
th: แก้ไขผู้ใช้

source: Site setting is not allowed user to delete themself.
th: การตั้งค่าของเว็บไซต์ไม่อนุญาตให้ผู้ใช้ลบบัญชีของตนเอง.

source: Unable to delete users.
th: ไม่สามารถลบผู้ใช้.

source: Unable to update users.
th: ไม่สามารถอัพเดทผู้ใช้.

source: Please select at least one user.
th: โปรดเลือกผู้ใช้อย่างน้อยหนึ่งราย.

source: Delete user
th: ลบผู้ใช้

source: Enable user
th: เปิดใช้งานผู้ใช้

source: Disable user
th: ปิดใช้งานผู้ใช้

source: Unable to edit guest user.
th: ไม่สามารถแก้ไขผู้ใช้ guest.

source: Unable to edit user who has higher priority role than you.
th: ไม่สามารถแก้ไขผู้ใช้ที่มีหน้าที่สูงกว่าคุณได้.

source: New user created.
th: สร้างผู้ใช้ใหม่แล้ว.

source: Your user account information
th: ข้อมูลบัญชีผู้ใช้ของคุณ

source: New user created. The new user needs confirmation and the email has been sent.
th: สร้างผู้ใช้ใหม่แล้ว. ผู้ใช้ใหม่ต้องยืนยันและอีเมลก็ได้ถูกส่งไปแล้ว.

source: Your user could not confirm account via the link in email.
th: ผู้ใช้ของคุณไม่สามารถยืนยันบัญชีผู้ใช้ผ่านลิ้งค์ในอีเมลได้.

source: Add new user
th: เพิ่มผู้ใช้ใหม่

source: Unable to edit the selected user.
th: ไม่สามารถแก้ไขผู้ใช้ที่เลือก.

source: The uploaded file exceeds the max file size directive. (%s &gt; %s).
th: ขนาดไฟล์ที่อัพโหลดเกินกว่าที่อนุญาต. (%s &gt; %s).

source: The uploaded file exceeds the MAX_FILE_SIZE directive that was specified in the HTML form.
th: ขนาดไฟล์ที่อัพโหลดเกินกว่าที่ระบุใน MAX_FILE_SIZE ซึ่งกำหนดในฟอร์ม.

source: The uploaded file was only partially uploaded.
th: ไฟล์ถูกอัพโหลดเพียงบางส่วน.

source: You did not upload the file.
th: คุณไม่ได้อัพโหลดไฟล์.

source: Missing a temporary folder.
th: ไม่พบโฟลเดอร์ชั่วคราว.

source: Failed to write file to disk.
th: ล้มเหลวในการเขียนไฟล์.

source: A PHP extension stopped the file upload.
th: ส่วนขยายของ PHP หยุดการอัพโหลด.

source: Unable to move uploaded file. (%s =&gt; %s)
th: ไม่สามารถย้ายไฟล์ที่อัพโหลดแล้วได้. (%s =&gt; %s)

source: Error! Found php embedded in the uploaded file. (%s).
th: ผิดพลาด! พบ php ฝังตัวอยู่ในไฟล์ที่อัพโหลด. (%s).

source: Error! Found cgi/perl embedded in the uploaded file. (%s).
th: ผิดพลาด! พบ cgi/perl ฝังตัวอยู่ในไฟล์ที่อัพโหลด. (%s).

source: Error! Found shell script embedded in the uploaded file. (%s).
th: ผิดพลาด! พบ shell script ฝังตัวอยู่ในไฟล์ที่อัพโหลด. (%s).

source: The target location where the uploaded file(s) will be moved to is not folder or directory.
th: ปลายทางที่ไฟล์อัพโหลดแล้วจะย้ายไปนั้นไม่ใช่โฟลเดอร์.

source: The target location where the uploaded file(s) will be moved to is not writable. Please check the folder permission.
th: ปลายทางที่ไฟล์อัพโหลดแล้วจะย้ายไปนั้นไม่สามารถเขียนได้. โปรดตรวจสอบการอนุญาตโฟลเดอร์.

source: Unable to validate extension for the file %s.
th: ไม่สามารถตรวจสอบสกุลไฟล์ %s.

source: Unable to validate the file extension and mime type. (%s). This file extension was not set in the &quot;file_extensions_mime_types&quot; property.
th: ไม่สามารถตรวจสอบประเภท mime และนามสกุลไฟล์. (%s). นามสกุลไฟล์ไม่ได้กำหนดในพร็อพเพอร์ตี้ &quot;file_extensions_mime_types&quot;.

source: You have uploaded the file that is not allowed extension. (%s)
th: คุณได้อัพโหลดไฟล์ที่มีนามสกุลที่ไม่ได้อนุญาตไว้. (%s)

source: The uploaded file has invalid mime type. (%s : %s).
th: ประเภท mime ไม่ถูกต้อง. (%s : %s).

source: Unable to validate mime type. The format of &quot;file_extensions_mime_types&quot; property is incorrect.
th: ไม่สามารถตรวจประเภท mime. รูปแบบสำหรับ &quot;file_extensions_mime_types&quot; นั้นไม่ถูกต้อง.

source: The uploaded image dimensions are larger than allowed max dimensions. (%s &gt; %s).
th: ภาพที่อัพโหลดมีขนาดใหญ่กว่าที่อนุญาต. (%s &gt; %s).

source: The uploaded image contain no image or multiple images. (%s).
th: ภาพที่อัพโหลดไม่ใช่ภาพจริงๆหรือมีหลายภาพ. (%s).

source: Access denied! You are trying to do the action that is not base on your account.
th: ปฏิเสธการเข้าถึง! คุณกำลังพยายามกระทำในสิ่งที่ไม่ได้อยู่บนบัญชีผู้ใช้ของคุณ.

source: Your email was changed.
th: อีเมลของคุณได้เปลี่ยนเรียบร้อยแล้ว.

source: Not found selected user.
th: ไม่พบผู้ใช้ที่เลือก.

source: User updated.
th: ปรับปรุงผู้ใช้เรียบร้อยแล้ว.

source: Email change request
th: ร้องขอเปลี่ยนอีเมล

source: Email changed
th: เปลี่ยนอีเมลแล้ว

source: Failed to change email.
th: ล้มเหลวในการเปลี่ยนอีเมล.

source: A confirmation to your new email could not be sent.
th: ไม่สามารถส่งอีเมลยืนยันไปยังอีเมลใหม่ได้.

source: There is a problem about changing email.
th: มีปัญหาเกี่ยวกับการเปลี่ยนอีเมล.

source: The email was changed but a notification email could not be sent.
th: อีเมลถูกเปลี่ยนแล้วแต่ไม่สามารถส่งอีเมลแจ้งเตือนได้.

source: Are you sure you want to delete this profile picture?
th: คุณแน่ใจหรือไม่ว่าจะลบรูปโปรไฟล์นี้?

source: Are you sure you want to upload selected profile picture?
th: คุณแน่ใจหรือไม่ว่าจะอัพโหลดรูปโปรไฟล์ที่เลือก?

source: Any existing profile picture will be changed.
th: รูปโปรไฟล์ใดๆที่มีอยู่แล้วจะเปลี่ยนไป.

source: You can only select one file.
th: คุณสามารถเลือกได้เพียงไฟล์เดียว.

source: Uploading
th: กำลังอัพโหลด

source: Previous emails
th: อีเมลที่ใช้ก่อนหน้า

source: Your session has been expired, please go to %1$slogin page%2$s.
th: เซสชั่นของคุณหมดอายุแล้ว, โปรดไปยัง%1$sหน้าเข้าสู่ระบบ%2$s.

source: Please select at least one session.
th: โปรดเลือกอย่างน้อยหนึ่งเซสชั่น.

source: Login sessions
th: รายการเข้าสู่ระบบ

source: Are you sure to delete?
th: คุณแน่ใจหรือไม่ที่จะลบ?

source: This cannot be undone.
th: นี่จะไม่สามารถเลิกกระทำได้.

source: Are you sure to delete them ALL?
th: คุณแน่ใจหรือไม่ที่จะลบ**ทั้งหมด**?

source: Current session
th: เซสชั่นปัจจุบัน

source: Failed
th: ล้มเหลว

source: Succeeded
th: สำเร็จ

source: Unknow
th: ไม่ทราบ

source: Your account has been locked due to your simultaneous login setting, please login using link that has been sent to your email.
th: บัญชีผู้ใช้ของคุณถูกระงับเนื่องจากการตั้งค่าเข้าสู่ระบบซ้ำซ้อนของคุณ, โปรดเข้าสู่ระบบโดยใช้ลิ้งค์ที่ส่งไปยังอีเมลของคุณ.

source: Your login link.
th: ลิ้งค์เข้าสู่ระบบของคุณ.

source: Simultaneous login detected but unable to send login link to your email.
th: ตรวจพบการเข้าสู่ระบบซ้ำซ้อน แต่ไม่สามารถส่งลิ้งเข้าสู่ระบบไปยังอีเมลของคุณ.

source: Please enter username.
th: กรุณากรอกชื่อผู้ใช้.

source: Please enter email.
th: กรุณากรอกอีเมล.

source: Please enter password.
th: กรุณากรอกรหัสผ่าน.

source: The password and confirmation is not matched.
th: รหัสผ่านและรหัสผ่านที่ยืนยันนั้นไม่ตรงกัน.

source: You cannot set new user's role that is higher than you.
th: คุณไม่สามารถกำหนดหน้าที่ผู้ใช้ใหม่ที่สูงกว่าคุณได้.

source: %1$s has higher priority than %2$s
th: %1$s มีความสำคัญมากกว่า %2$s

source: Unable to retrieve new user's role. Cannot save user, please contact administrator.
th: ไม่สามารถดึงข้อมูลหน้าของผู้ใช้ใหม่ได้. ไม่สามารถบันทึกผู้ใช้, โปรดติดต่อผู้ดูแล.

source: Unable to retrieve your user role to check with new user's role. Cannot save user, please contact administrator.
th: ไม่สามารถดึงข้อมูลหน้าที่ของคุณมาตรวจสอบกับหน้าที่ของผู้ใช้ใหม่ได้. ไม่สามารถบันทึกผู้ใช้, โปรดติดต่อผู้ดูแล.

source: Manage users
th: จัดการผู้ใช้

source: You have continuous login failed over %1$d times, you have to wait for %2$d minutes. Please try again in %3$s.
th: คุณได้เข้าสู่ระบบผิดพลาดต่อเนื่องเกิน %1$d ครั้ง, คุณต้องรอ %2$d นาที. โปรดลองใหม่อีกครั้งในเวลา %3$s.

source: Unable to verify code or your code may expired.
th: ไม่สามารถตรวจสอบรหัสได้ หรือรหัสของคุณอาจหมดอายุแล้ว.

source: If your code are expired, please try to login again.
th: ถ้ารหัสของคุณหมดอายุ, โปรดเข้าสู่ระบบอีกครั้ง.

source: You had submitted more than %d times, please try to login again.
th: คุณได้กรอกแล้วมากกว่า %d ครั้ง, โปรดเข้าสู่ระบบใหม่.

source: The username or password is incorrect.
th: ชื่อผู้ใช้หรือรหัสผ่านไม่ถูกต้อง.

source: Login successfully.
th: เข้าสู่ระบบเรียบร้อย.

source: The 2 step verification code email has just been sent recently, please wait and try again later.
th: อีเมลรหัสขั้นตอนที่ 2 เพิ่งถูกส่งไม่นานนี้, กรุณารอและลองใหม่ในภายหลัง.

source: 2 Step verification code
th: รหัสการตรวจสอบ 2 ขั้นตอน

source: 2 Step verification code was sent successfully, please enter the code you recieved.
th: รหัสยืนยัน 2 ขั้นตอนถูกส่งเรียบร้อยแล้ว. โปรดกรอกรหัสที่คุณได้รับ.

source: A 2 step verification email could not be sent.
th: อีเมลตรวจสอบ 2 ขั้นตอนไม่สามารถส่งได้.

source: Close
th: ปิด

source: The API key does not matched.
th: กุญแจ API ไม่ตรงกัน.

source: Please wait for administrator confirmation.
th: โปรดรอผู้ดูแลทำการยืนยันสมัครสมาชิก.

source: Permissions
th: การอนุญาต

source: Roles
th: หน้าที่

source: Settings
th: ตั้งค่า

source: Tools
th: เครื่องมือ

source: Add
th: เพิ่ม

source: Change settings
th: เปลี่ยนการตั้งค่า

source: Change priority
th: เปลี่ยนความสำคัญ

source: Change roles
th: เปลี่ยนหน้าที่

source: Delete
th: ลบ

source: Delete logins
th: ลบรายการเข้าสู่ระบบ

source: Edit
th: แก้ไข

source: List items
th: แสดงรายการ

source: List plugins
th: แสดงรายการปลั๊กอิน

source: Manage modules
th: จัดการโมดูล

source: Manage plugins
th: จัดการปลั๊กอิน

source: Publish assets to the public
th: เผยแพร่ assets ไปยังสาธารณะ

source: View logins
th: ดูรายการเข้าสู่ระบบ

source: Enter your email address to reset your password.
th: กรอกอีเมลของคุณเพื่อตั้งค่ารหัสผ่านใหม่.

source: You may need to check your spam folder.
th: คุณอาจต้องตรวจสอบโฟลเดอร์สแปมของคุณ.

source: Username or Email
th: ชื่อผู้ใช้หรืออีเมล

source: Email
th: อีเมล

source: Please skip this field.
th: โปรดข้ามฟิลด์นี้.

source: Submit
th: ส่งข้อมูล

source: Change language
th: เปลี่ยนภาษา

source: Your account: %1$s
th: บัญชีผู้ใช้ของคุณ: %1$s

source: New password
th: รหัสผ่านใหม่

source: Confirm new password
th: ยืนยันรหัสผ่าน

source: Proceed to login
th: ดำเนินการเข้าสู่ระบบต่อไป

source: Password
th: รหัสผ่าน

source: Remember me
th: จดจำฉันไว้

source: Verify
th: ตรวจสอบ

source: You get logged out to prevent simultaneous log in (depend on your setting). To log in again, please set the new password.
th: คุณถูกให้ออกจากระบบเพื่อป้องกันการเข้าสู่ระบบซ้ำซ้อน (ขึ้นอยู่กับการตั้งค่าของคุณ). เพื่อจะเข้าสู่ระบบได้อีก, โปรดกำหนดรหัสผ่านใหม่.

source: Logout on all devices
th: ออกจากระบบบนทุกอุปกรณ์

source: Go to login page
th: ไปยังหน้าเข้าสู่ระบบ

source: ID
th: ไอดี

source: Module
th: โมดูล

source: Number of assets
th: จำนวน assets

source: Location
th: ตำแหน่ง

source: Status
th: สถานะ

source: Version
th: รุ่น

source: items
th: รายการ

source: item
th: รายการ

source: Publish
th: เผยแพร่

source: Apply
th: นำไปใช้

source: The publish action will be copy asset files and folders into the public folder where anyone can access via web address.
th: คำสั่งเผยแพร่จะเป็นการทำซ้ำไฟล์และโฟลเดอร์ของ asset ไปยังโฟลเดอร์สาธารณะที่ซึ่งทุกๆคนเข้าถึงได้ทางที่อยู่เว็บไซต์.

source: Plugin
th: ปลั๊กอิน

source: Description
th: รายละเอียด

source: Enable
th: เปิดใช้งาน

source: Disable
th: ปิดใช้งาน

source: Author
th: ผู้เขียน

source: Requires PHP
th: ต้องการ PHP

source: Requires modules
th: ต้องการโมดูล

source: Permission for
th: การอนุญาตสำหรับ

source: Username
th: ชื่อผู้ใช้

source: Filter
th: กรอง

source: Clear all permissions for this module (including roles and users).
th: ล้างค่าการอนุญาตทั้งหมดสำหรับโมดูลนี้ (รวมหน้าที่และผู้ใช้ทั้งหมด).

source: Clear
th: ล้างค่า

source: Confirm password
th: ยืนยันรหัสผ่าน

source: Confirm
th: ยืนยัน

source: The confirmation email will be sent to you and you have to click on confirm link in your email.
th: อีเมลยืนยันจะส่งไปหาคุณและคุณต้องคลิกลิ้งค์ยืนยันในอีเมลของคุณ.

source: You have to wait for administrator to confirm your registration.
th: คุณต้องรอผู้ดูแลทำการยืนยันสมัครสมาชิก.

source: Register
th: ลงทะเบียน

source: Please select user's default role
th: โปรดเลือกหน้าที่ค่าเริ่มต้น

source: You are deleting at least a role that is in user's default role on register, please select a new one.
th: คุณกำลังลบหน้าที่อย่างน้อยหนึ่งรายการที่อยู่ในค่าเริ่มต้นของผู้ใช้ตอนลงทะเบียน, โปรดเลือกรายการใหม่.

source: User's default role
th: หน้าที่ค่าเริ่มต้น

source: Replace user's role
th: แทนที่หน้าที่ของผู้ใช้

source: The selected roles maybe in your current user's role, please select a new one if they will be deleted.
th: หน้าที่ที่เลือกอาจจะอยู่ในหน้าที่ของผู้ใช้ของคุณ, โปรดเลือกรายการใหม่ถ้ามันจะถูกลบ.

source: Role
th: หน้าที่

source: Save
th: บันทึก

source: Created date
th: วันที่สร้าง

source: Last update
th: อัพเดทล่าสุด

source: Priority
th: ความสำคัญ

source: Search
th: ค้นหา

source: More
th: เพิ่มเติม

source: Reset
th: เริ่มใหม่

source: Search settings
th: ค้นหาการตั้งค่า

source: Website
th: เว็บไซต์

source: User
th: ผู้ใช้

source: Website name
th: ชื่อเว็บไซต์

source: Timezone
th: โซนเวลา

source: Number of items per page
th: จำนวนรายการต่อหน้า

source: Number of items per page in administrator pages.
th: จำนวนรายการต่อหน้าในหน้าผู้ดูแล.
