Repository: RundizBones/ModuleAdmin
Catalog: languages/translations/rdbadmin-*.po
Languages: th

source: Delete this favicon
th: ลบ favicon นี้

source: Drop a file into this area to start upload.
th: วางไฟล์ลงในพื้นที่นี้เพื่อเริ่มอัพโหลด.

source: Choose a file
th: เลือกไฟล์

source: Click on choose a file or drop a file here to start upload.
th: คลิกที่เลือกไฟล์หรือวางไฟล์บนพื้นที่นี่เพื่อเริ่มอัพโหลด.

source: Max file size %s.
th: ขนาดไฟล์สูงสุด %s.

source: Recommended image size is %1$s pixels.
th: ขนาดภาพที่แนะนำคือ %1$s พิกเซล.

source: API access
th: การเข้าถึง API

source: Allow origins
th: แหล่งที่อนุญาต

source: The %1$s header to be sent to client. To set multiple origins, separate them with comma (%2$s) and the system will be use one per header.
th: ส่วนหัว %1$s จะถูกส่งไปยังไคลเอนท์. การตั้งค่าแหล่งที่มาหลายแหล่ง ให้แยกด้วยเครื่องหมายจุลภาค (%2$s) แล้วระบบจะนำไปใช้หนึ่งรายการต่อหัว.

source: Limited access to API
th: จำกัดการเข้าถึง API

source: Require API key to access via REST API.
th: ต้องการกุญแจ API เพื่อจะเข้าใช้งาน REST API.

source: If you limited access via REST API, the API key is required.
th: หากคุณจำกัดการเข้าถึงทาง REST API, กุญแจ API จะต้องใช้.

source: API key
th: กุญแจ API

source: The API key to access via REST API.
th: กุญแจ API เพื่อจะเข้าใช้งาน REST API.

source: Recommended %1$d to %2$d characters long, contain letters, numbers, and/or special characters without space.
th: แนะนำให้มีความยาวอักขระ %1$d ถึง %2$d ตัว ประกอบด้วยตัวอักษร ตัวเลข และ/หรืออักขระพิเศษโดยไม่เว้นวรรค.

source: To access REST API with key, use one of these headers: %1$s or use method %2$s body parameter %3$s.
th: การเรียกใช้ REST API พร้อมด้วยกุญแจ, ใช้หนึ่งในส่วนหัวเหล่านี้: %1$s หรือใช้เมธอด %2$s กับพารามิเตอร์ %3$s.

source: Regenerate API key
th: สร้างกุญแจ API ใหม่

source: Registration
th: การลงทะเบียน

source: Anyone can be register
th: ทุกคนลงทะเบียนได้

source: Send notification email to administrators
th: ส่งอีเมลแจ้งเตือนไปยังผู้ดูแล

source: A notification email still be sent if registration verification must be done by an administrator.
th: อีเมลแจ้งเตือนจะยังคงส่งถ้าหากการตรวจสอบลงทะเบียนต้องกระทำโดยผู้ดูแล.

source: Registration verification
th: การตรวจสอบการลงทะเบียน

source: No verification
th: ไม่ใช้การตรวจสอบ

source: Verify by the link in user's email
th: ตรวจโดยลิ้งค์ในอีเมลผู้ใช้

source: Verify by an administrator
th: ตรวจโดยผู้ดูแล

source: Registration verification wait time
th: ระยะเวลารอตรวจสอบการลงทะเบียน

source: days
th: วัน

source: How many days that user needs to take action to verify their email on register or added a new user by admin?
th: ระยะเวลากี่วันที่ผู้ใช้ต้องลงมือกระทำเพื่อตรวจสอบยืนยันอีเมลการลงทะเบียนหรือการถูกเพิ่มผู้ใช้โดยผู้ดูแล?

source: Admin notification emails
th: อีเมลแจ้งเตือนผู้ดูแล

source: The administrator's emails to notify where there is new user registration.
th: อีเมลผู้ดูแลที่จะแจ้งเตือนเมื่อมีผู้ใช้ลงทะเบียนใหม่.

source: Use comma %s to separate multiple emails.
th: ใช้เครื่องหมายคอมม่า %s เพื่อแยกหลายอีเมล.

source: Disallowed name
th: ไม่อนุญาตชื่อ

source: Disallowed name to use in username, email, display name.
th: ไม่อนุญาตชื่อในชื่อผู้ใช้, อีเมล, ชื่อแสดง.

source: Use comma %s to separate multiple names.
th: ใช้เครื่องหมายคอมม่า %s เพื่อแยกหลายชื่อ.

source: Use asterisk %s as wild card in each name.
th: ใช้เครื่องหมายดอกจัน %s แทนอักขระใดๆก็ตามในแต่ละชื่อ.

source: Default role
th: หน้าที่เริ่มต้น

source: Default role to use when user register their account or add new user from administrator page.
th: หน้าที่เริ่มต้นที่จะใช้เมื่อผู้ใช้ลงทะเบียนสมาชิกหรือเพิ่มผู้ใช้ผ่านหน้าผู้ดูแล.

source: Login & Security
th: การเข้าสู่ระบบ & ความปลอดภัย

source: Login time period without remember
th: ระยะเวลาเข้าสู่ระบบกับการไม่ให้จดจำ

source: Number of days for cookie to be expire when user login without remember option checked. Use zero to keep session until browser close.
th: จำนวนวันสำหรับคุกกี้ที่จะหมดอายุเมื่อผู้ใช้เข้าสู่ระบบกับไม่ได้เลือกให้จดจำ. ใช้เลขศูนย์สำหรับให้หมดอายุเมื่อปิดเบราเซอร์.

source: Login time period with remember
th: ระยะเวลาเข้าสู่ระบบกับการให้จดจำ

source: Number of days for cookie to be expire when user login with remember option checked.
th: จำนวนวันสำหรับคุกกี้ที่จะหมดอายุเมื่อผู้ใช้เข้าสู่ระบบกับตัวเลือกให้จดจำ.

source: Prevent brute-force attack by IP address
th: ป้องกันการสุ่มโจมตีโดยที่อยู่ไอพี

source: Prevent brute-force attack by device cookie
th: ป้องกันการสุ่มโจมตีโดย device cookie

source: Read more about device cookie at %1$s.
th: อ่านเพิ่มเติมเกี่ยวกับ device cookie ได้ที่ %1$s.

source: Maximum login failed
th: ล้มเหลวในการเข้าสู่ระบบไม่เกิน

# Number of times such as 3 times.
source: times
th: ครั้ง

source: Maximum of failed login allowed.
th: จำนวนมากที่สุดที่จะอนุญาตเมื่อเข้าสู่ระบบล้มเหลว.

source: This will work only when one of brute-force option were checked.
th: นี่จะทำงานเฉพาะตัวเลือกป้องกันการสุ่มโจมตีถูกติ๊ก.

source: Login failed wait time
th: เวลาที่ต้องรอหลังจากเข้าสู่ระบบล้มเหลว

source: minutes
th: นาที

source: Wait time in minutes if user reach maximum login failed.
th: จำนวนนาทีที่รอถ้าผู้ใช้ล้มเหลวในการเข้าสู่ระบบเกินจำนวนที่ระบุ.

source: Other user settings
th: การตั้งค่าผู้ใช้อื่นๆ

source: Confirmation is required when users change their email
th: ต้องการการยืนยันเมื่อผู้ใช้เปลี่ยนอีเมลของพวกเขา

source: A confirmation message with link will be sent to new user's email.
th: ข้อความและลิ้งค์ยืนยันจะส่งไปยังอีเมลใหม่ของผู้ใช้.

source: Confirmation wait time
th: เวลารอในการยืนยัน

source: Number of minutes that a user must take action when waiting for confirmation.
th: จำนวนนาทีที่ผู้ใช้ต้องลงมือกระทำเมื่อมีการรอการยืนยัน.

source: Example: reset password, change email, prevent simultaneuos login link, etc.
th: ตัวอย่าง: ตั้งค่ารหัสผ่านใหม่, เปลี่ยนอีเมล, ลิ้งค์เข้าสู่ระบบป้องกันการเข้าสู่ระบบซ้ำซ้อน, อื่นๆ.

source: Logins log expiration
th: การหมดอายุของบันทึกการเข้าสู่ระบบ

source: How many days that user's failed logins data to keep in database?
th: บันทึกการเข้าสู่ระบบที่ล้มเหลวของผู้ใช้จะถูกเก็บไว้ในฐานข้อมูลเป็นเวลากี่วัน?

source: Allow user to delete their account
th: อนุญาตให้ผู้ใช้ลบบัญชีของตน

source: If allowed, once account was deleted it will be stay in the database for days before actual deleted.
th: ถ้าอนุญาต, เมื่อบัญชีผู้ใช้ถูกลบแล้ว มันจะอยู่ในฐานข้อมูลหลายวันก่อนจะถูกลบจริงๆ.

source: Actual delete user
th: ลบผู้ใช้จริง

source: On delete user wether delete themself or by admin, How many days before it gets actual delete from database?
th: เมื่อมีการลบผู้ใช้ ไม่ว่าจะโดยผู้ใช้ลบตัวเองหรือโดยผู้ดูแล, จะใช้เวลากี่วันก่อนที่ผู้ใช้นั้นจะถูกลบจริงๆจากฐานข้อมูล?

source: Email protocol
th: โปรโตคอลอีเมล

source: Sendmail path
th: ตำแหน่งสำหรับโปรแกรม Sendmail

source: SMTP encryption
th: การเข้ารหัส SMTP

source: No encryption
th: ไม่มีการเข้ารหัส

source: SMTP username
th: ชื่อผู้ใช้ SMTP

source: SMTP password
th: รหัสผ่าน SMTP

source: Test connection
th: ทดสอบการเชื่อมต่อ

source: Sender email
th: อีเมลผู้ส่ง

source: An email that will be use as sender such as registration verification email.
th: อีเมลที่จะใช้ในฐานะผู้ส่ง ตัวอย่างเช่นอีเมลตรวจสอบการลงทะเบียน.

source: Cache driver
th: ไดรเวอร์สำหรับแคช

source: Base path
th: พาธพื้นฐาน

source: Total file size
th: ขนาดไฟล์ทั้งหมด

source: Total files and folders
th: จำนวนไฟล์และโฟลเดอร์ทั้งหมด

source: Target email
th: อีเมลปลายทาง

source: Last logged in users
th: ผู้ใช้เข้าสู่ระบบล่าสุด

source: Last %1$d logged in users.
th: ผู้ใช้เข้าสู่ระบบล่าสุด %1$d รายการ.

source: Date/time
th: วันที่/เวลา

source: System info
th: ข้อมูลระบบ

source: Total users: %d
th: ผู้ใช้ทั้งหมด: %d

source: Enabled users: %d
th: ผู้ใช้เปิดใช้งาน: %d

source: Disabled users: %d
th: ผู้ใช้ปิดใช้งาน: %d

source: Please note that this will be mark the users as deleted, the marked users will be really deleted after %1$d days.
th: โปรดทราบว่านี่จะเป็นการทำเครื่องหมายว่าผู้ใช้ถูกลบแล้ว, ผู้ใช้ที่ถูกทำเครื่องหมายจะถูกลบจริงๆหลังจาก %1$d วัน.

source: Username cannot be changed.
th: ชื่อผู้ใช้ไม่สามารถเปลี่ยนได้.

source: Display name
th: ชื่อแสดง

source: Security
th: ความปลอดภัย

source: Roles and status
th: หน้าที่และสถานะ

source: Send user notification
th: ส่งแจ้งเตือนผู้ใช้

source: Send an email to notify user about their account.
th: ส่งอีเมลไปแจ้งเตือนผู้ใช้เกี่ยวกับบัญชีของเขา.

source: If this were checked, the status will be disabled and this user have to click on the activation link.
th: ถ้าช่องนี้ถูกติ๊ก, สถานะจะเป็นปิดใช้งานและผู้ใช้นี้จะต้องคลิกลิ้งค์ยืนยัน.

source: Status description
th: รายละเอียดสถานะ

source: If status is disabled, please describe the reason.
th: ถ้าปิดใช้งาน, โปรดอธิบายรายละเอียด.

source: Last login
th: เข้าสู่ระบบล่าสุด

source: Once you had confirmed, you will be unable to login and use this account again.
th: เมื่อคุณยืนยันแล้ว, คุณจะไม่สามารถเข้าสู่ระบบและใช้งานบัญชีนี้ได้อีก.

source: Confirm delete
th: ยืนยันการลบ

source: Cancel
th: ยกเลิก

source: Only fill this form if you want to change the password.
th: กรอกช่องนี้เฉพาะถ้าคุณต้องการเปลี่ยนรหัสผ่าน.

source: Simultaneous logins
th: เข้าสู่ระบบซ้ำซ้อน

source: Allow simultaneous login
th: อนุญาตเข้าสู่ระบบซ้ำซ้อน

source: Allow only last success login (if there is new success login session, the older sessions will be logged out).
th: อนุญาตเฉพาะที่เข้าสู่ระบบสำเร็จครั้งล่าสุด (ถ้ามีการเข้าสู่ระบบสำเร็จครั้งใหม่, ครั้งเก่าก่อนหน้าจะถูกออกจากระบบทั้งหมด).

source: Log out all sessions and send login link to email
th: ออกจากระบบทั้งหมดและส่งลิ้งค์เข้าสู่ระบบไปยังอีเมล

source: How to handle with simultaneous logins?
th: จะจัดการกับการเข้าสู่ระบบซ้ำซ้อนอย่างไร?

source: 2 Step verification
th: การตรวจสอบ 2 ขั้นตอน

source: Not in use
th: ไม่ใช้งาน

source: Send verification code to my email
th: ส่งรหัสตรวจสอบไปยังอีเมลของฉัน

source: Select method to use for second verification step after entering your password.
th: เลือกวิธีที่จะใช้ในการตรวจสอบขั้นที่สองหลังจากกรอกรหัสผ่านถูกต้องแล้ว.

source: Other info.
th: ข้อมูลอื่นๆ.

source: Profile picture
th: รูปโปรไฟล์

source: Use upload profile picture
th: ใช้อัพโหลดรูปโปรไฟล์

source: Use Gravatar
th: ใช้ Gravatar

source: Change your profile picture on Gravatar.
th: เปลี่ยนรูปภาพของคุณบน Gravatar.

source: Delete this profile picture
th: ลบรูปโปรไฟล์นี้

source: Choose image
th: เลือกรูป

source: Remove file
th: เอาไฟล์ออก

source: Click on choose image or drop image into the area above to upload profile picture.
th: คลิกที่เลือกรูปหรือวางรูปภาพบนพื้นที่ด้านบนเพื่ออัพโหลดรูปโปรไฟล์.

source: Changed date
th: วันที่ถูกเปลี่ยน

source: View all
th: ดูทั้งหมด

source: Danger zone
th: โซนอันตราย

source: Delete account
th: ลบบัญชีผู้ใช้

source: All
th: ทั้งหมด

source: Previously used emails of the user %s.
th: อีเมลที่ใช้ก่อนหน้าของผู้ใช้ %s.

source: Show more details
th: แสดงรายละเอียดเพิ่มเติม

source: Login sessions of the user %s.
th: รายการเข้าสู่ระบบของผู้ใช้ %s.

source: IP address
th: ที่อยู่ไอพี

source: Result
th: ผลลัพธ์

source: Delete/Logout
th: ลบ/ออกจากระบบ

source: Delete/Logout all
th: ลบ/ออกจากระบบทั้งหมด

source: Toggle side bar menu
th: ปรับแสดงเมนูด้านข้าง

source: Expane/collapse menu
th: ขยาย/ย่อเมนู

source: Hello, %1$s
th: สวัสดี, %1$s

source: Edit your account
th: แก้ไขบัญชีผู้ใช้ของคุณ
